kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
/** \addtogroup CODE_TEMPLATE
 *  @{
 * @file eeprom_emul.c
 *
 * @brief This file provides all the EEPROM emulation firmware functions.
 *
 * File Short Name: eeprom_emul
 *
 * @author: DEVIDRAJ.K
 *
 * @date: 4th April 2024
 *
 * @copyright:  All information contained herein is, and remains the property of
 * eSTAR TECHNOLOGIES(OPC) PRIVATE LIMITED and its suppliers, if any.
 * Dissemination of this information or reproduction of this material is strictly
 * forbidden unless prior written permission is obtained from
 * eSTAR TECHNOLOGIES(OPC) PRIVATE LIMITED
********************************************************************************************** @}*/

/**************************************************************************************************
 * Include Platform or Standard Headers
***************************************************************************************************/
#include "stdio.h"
#include "string.h"
/**************************************************************************************************
 * Include Project Specific Headers
***************************************************************************************************/
#include "eeprom_emul.h"
#include "stm32h735g_discovery_ospi.h"
#include "eeprom_emul_cfg.h"
#include "checksum.h"
#include "flash_interface.h"

/**************************************************************************************************
 * DEFINE FILE SCOPE MACROS
***************************************************************************************************/

/**************************************************************************************************
 * DEFINE FILE SCOPE TYPES
***************************************************************************************************/
/* Type of state requested :
        ERASED  --> page is erased
        RECEIVE --> page used during data transfer when no more space available in the system
        ACTIVE  --> page contains valid data and is not full
        VALID   --> page contains valid data and is full
        ERASING --> page used during transfer, should be erased after transfer
        INVALID --> page invalid state */
typedef enum {
    STATE_PAGE_ERASED,
    STATE_PAGE_RECEIVE,
    STATE_PAGE_ACTIVE,
    STATE_PAGE_VALID,
    STATE_PAGE_ERASING,
    STATE_PAGE_INVALID
} EE_State_type;

/* Type of find requested :
        READ  --> page in active state
        WRITE --> page in receive state or active state
        ERASE --> page in erased state */
typedef enum {
    FIND_READ_PAGE,
    FIND_WRITE_PAGE,
    FIND_ERASE_PAGE
} EE_Find_type;


/* Definition of the different type of page transfer
        NORMAL  -> copy data page source to page destination
        RECOVER -> resume page transfer that has been interrupted */
typedef enum {
    EE_TRANSFER_NORMAL,
    EE_TRANSFER_RECOVER
} EE_Transfer_type;


/* Reliability of page state:
        RELIABLE  -> header of page is not corrupted, state is reliable
        CORRUPTED -> header of page is corrupted, state is corrupted */
typedef enum {
    STATE_RELIABLE,
    STATE_CORRUPTED
} EE_State_Reliability;

/**************************************************************************************************
 * DECLARE GLOBAL VARIABLES\n
***************************************************************************************************/
uint16_t usNbWrittenElements = 0U;                 					/*!< Nb of elements written in valid and active pages */
uint8_t ucCurrentActivePage = 0U;                  					/*!< Current active page (can be active or receive state) */
uint32_t ulAddressNextWrite = ((0x00000000)+(PAGE_HEADER_SIZE));    /*!< Initialize write position just after page header */

/**************************************************************************************************
 * DECLARE FILE STATIC VARIABLES\n
***************************************************************************************************/

/**************************************************************************************************
 * DEFINE FILE SCOPE FUNCTION PROTOTYPES\n
***************************************************************************************************/
EE_Status prvEE_Format(EE_Erase_type EraseType);
EE_Status xEE_Init(EE_Erase_type EraseType);
EE_Status xEE_ReadVariable32bits(uint32_t VirtAddress, uint32_t* pData);
EE_Status xEE_WriteVariable32bits(uint32_t VirtAddress, uint32_t Data);
EE_Status prvEE_CleanUp(void);


EE_Status prvReadVariable(uint32_t VirtAddress, EE_DATA_TYPE* pData);
EE_Status prvWriteVariable(uint32_t VirtAddress, EE_DATA_TYPE Data);
EE_Status prvPagesTransfer (uint32_t VirtAddress, EE_DATA_TYPE Data, EE_Transfer_type Type);
EE_Status prvVerifyPageFullyErased(uint32_t Address, uint32_t PageSize);
uint32_t prvFindPage(EE_Find_type Operation);
EE_Status prvVerifyPagesFullWriteVariable(uint32_t VirtAddress, EE_DATA_TYPE Data);
EE_Status prvSetPageState(uint32_t Page, EE_State_type State);
EE_State_type prvGetPageState(uint32_t Address);
/**************************************************************************************************
 * FUNCTION DEFINITIONS
***************************************************************************************************/

/**
  * @brief  Erases PAGE and PAGE1 and writes VALID_PAGE header to PAGE
  * @param  None
  * @retval Status of the last operation (Flash write or erase) done during
  *         EEPROM formatting
  */

EE_Status prvEE_Format(EE_Erase_type EraseType)
{
  uint32_t ulPage = 0U;

  /* Erase All Pages */
  for (ulPage = START_PAGE; ulPage < (START_PAGE + PAGES_NUMBER); ulPage++)
   {
		if (EraseType == EE_FORCED_ERASE)
		{
			if (xFI_PageErase(PAGE_ADDRESS(ulPage))!= EE_OK)
			{
				return EE_ERASE_ERROR;
			}
		}
		else /* EraseType == EE_CONDITIONAL_ERASE */
		{
			/* Check if Page is not yet fully erased */
			if (prvVerifyPageFullyErased(PAGE_ADDRESS(ulPage), PAGE_SIZE) == EE_PAGE_NOTERASED)
			{
				/* Erase the page */
				/* If Erase operation was failed, a Flash error code is returned */
				if (xFI_PageErase(PAGE_ADDRESS(ulPage))!= EE_OK)
				{
					return EE_ERASE_ERROR;
				}
			}
		}
   }

	/* Set first Page in Active State */
	/* If program operation was failed, a Flash error code is returned */
    if (prvSetPageState(START_PAGE, STATE_PAGE_ACTIVE) != EE_OK)
    {
      return EE_WRITE_ERROR;
    }

