kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
				/* If page is not erasing, return error */
				if (pagestatus != STATE_PAGE_ERASING)
				{
					return EE_ERROR_NOERASING_PAGE;
				}
			}

			/* Erase all the pages of the group */
			/* If erase operation fails, a Flash error code is returned */
			for (ulPage = 0; ulPage < ((PAGES_NUMBER *PAGE_SIZE) / 2U); ulPage+=PAGE_SIZE)
			{
				if (xFI_PageErase(((PAGE_ADDRESS(ulFirstPage)+ulPage)))!= EE_OK)
				{
					return EE_ERASE_ERROR;
				}

			}
			return EE_OK;
		}
	}
	/* Error if no erasing pages group is found */
	return EE_ERROR_NOERASING_PAGE;
}


/**
  * @brief  Verify if specified page is fully erased.
  * @param  Address page address
  * @param  PageSize page size
  * @retval EE_Status
  *           - EE_PAGE_NOTERASED : if Page not erased
  *           - EE_PAGE_ERASED    : if Page erased
  */
EE_Status prvVerifyPageFullyErased(uint32_t Address, uint32_t PageSize)
{
  EE_Status readstatus = EE_PAGE_ERASED;
  uint16_t usCounter = 0U;
  uint64_t ulReadData =0U;
  uint8_t ucData[8]={0};


  /* Check each element in the page */
	while (usCounter < PageSize)
	{
        // Read 8 bytes from EEPROM
        xFI_Read((Address + usCounter), ucData, 8);

        // Extract 64-bit data from the 8-byte array in little-endian format using a for loop
        ulReadData = 0;
        for (int i = (EE_HEADER_ELEMENT_SIZE-1); i >=0; i--)
        {
            ulReadData |= ((uint64_t)ucData[i] << (8 * i));
        }
        if (ulReadData != EE_PAGESTAT_ERASED)
        {
            // In case one element is not erased, reset readstatus flag
            readstatus = EE_PAGE_NOTERASED;
        }
		/* Next address - Double word Location */
		usCounter = usCounter + 8;
	}

  /* Return readstatus value */
  return readstatus;
}

/**
  * @brief  Returns the last stored variable data, if found, which correspond to
  *         the passed virtual address
  * @param VirtAddress Variable virtual address on 16 bits (can't be 0x0000 or 0xFFFF)
  * @param  pData Variable containing the EE_DATA_TYPE read variable value
  * @retval EE_Status
  *           - EE_OK: if variable was found
  *           - EE error code: if an error occurs
  */

EE_Status prvReadVariable(uint32_t VirtAddress, EE_DATA_TYPE* pData)
{
	uint32_t ulPage = 0U;
	uint32_t ulPageAddress = 0U;
	uint32_t ulCounter = 0U ;
	uint8_t ucReadData[EE_ELEMENT_SIZE] = {0x00};
	uint32_t ulReadAddr = 0;
	uint16_t usCRCRead = 0;
	uint16_t usCRCCalculated = 0;
	uint32_t ulData = 0;

    EE_State_type pagestate = STATE_PAGE_INVALID;

    /* Get active Page for read operation */
    ulPage = prvFindPage(FIND_READ_PAGE);

    /* Check if there is no active page */
    if (ulPage == EE_NO_PAGE_FOUND)
    {
    	return EE_ERROR_NOACTIVE_PAGE;
    }
    ulPageAddress = PAGE_ADDRESS(ulPage);
    pagestate = prvGetPageState(ulPageAddress);

    /* Search variable in active page and valid pages until erased page is found
       or in erasing pages until erased page is found */
    while ((pagestate == STATE_PAGE_ACTIVE) || (pagestate == STATE_PAGE_VALID) || (pagestate == STATE_PAGE_ERASING))
    {
    	/* Set counter index to last element written position in the active page */
    	ulCounter =  ulAddressNextWrite;
		/* Check each page address starting from end */
		while (ulCounter >= PAGE_HEADER_SIZE)
		{
			/* Get the current location content to be compared with virtual address */
			xFI_Read(ulPageAddress + ulCounter,ucReadData,EE_ELEMENT_SIZE);

//			ulReadAddr = (ucReadData[0]|ucReadData[1]<<8|ucReadData[2]<<16|ucReadData[3]<<24);
			ulReadAddr = (ucReadData[0]<<24|ucReadData[1]<<16|ucReadData[2]<<8|ucReadData[3]);
 			if (ulReadAddr != 0xFFFFFFFFU)
 			{
				/* Compare the read address with the virtual address */
				if (ulReadAddr == VirtAddress)
				{
					/* Get content of variable value */
					ulData = (ucReadData[4]<<24|ucReadData[5]<<16|ucReadData[6]<<8|ucReadData[7]);

					usCRCCalculated = xCrc16BitPolinomial_1021(&ucReadData[4],4,0);

					usCRCRead = (ucReadData[8]<<8|ucReadData[9]);

					if (usCRCCalculated == usCRCRead)
					{
						*pData = ulData ;
						return EE_OK;
					}
					else
					{
						return EE_READ_DATA_INVALID;
					}
        		}
        	}
        	/* Next address location */
			ulCounter -= EE_ELEMENT_SIZE;
      	}
      	/* Decrement page index circularly, among pages allocated to eeprom emulation */
		ulPage = PREVIOUS_PAGE(ulPage);
		ulPageAddress = PAGE_ADDRESS(ulPage);
		pagestate = prvGetPageState(ulPageAddress);
    }
	/* Variable is not found */
	return EE_NO_DATA;
}


/**
  * @brief  Writes/updates variable data in EEPROM
  *         Trig internal Pages transfer if half of the pages are full
  * @param VirtAddress Variable virtual address on 16 bits (can't be 0x0000 or 0xFFFF)
  * @param  Data EE_DATA_TYPE data to be written
  * @retval EE_Status
  *           - EE_OK: on success, without page transfer
  *           - prvEE_CleanUp_REQUIRED: on success, with page transfer occured
  *           - EE_FLASH_USED: flash currently used by CPU2
  *           - EE error code: if an error occurs
  */

 EE_Status prvWriteVariable(uint32_t VirtAddress, EE_DATA_TYPE Data)
{
  EE_Status status = EE_OK;

  /* Write the variable virtual address and value in the EEPROM, if not full */
  	status = prvVerifyPagesFullWriteVariable(VirtAddress, Data);
  	if (status == EE_PAGE_FULL)
	{
		/* In case the EEPROM pages are full, perform Pages transfer */
		return prvPagesTransfer (VirtAddress, Data, EE_TRANSFER_NORMAL);
	}
	/* Return last operation status */
	return status;
}

/**
  * @brief  Find suitable page for read/write/erase operation.
  *   It also update pages state if current page is full.
  *   And it force cleanup if all pages are full.
  * @param  Operation Type of page to be requested.
  *   This parameter can be one of the following values:
  *     @arg @ref FIND_READ_PAGE return the active page index
  *     @arg @ref FIND_WRITE_PAGE return the write page index
  *     @arg @ref FIND_ERASE_PAGE return the erase page index
  * @retval Page_Index
  *           - Page Index: on success
  *           - @ref EE_NO_PAGE_FOUND : if an error occurs
  */
uint32_t prvFindPage(EE_Find_type Operation)
{
  EE_State_type currentpagestatus = STATE_PAGE_INVALID;
  EE_State_type followingpagestatus = STATE_PAGE_INVALID;
  uint32_t ulCurrentPage = 0U;
  uint32_t ulFollowingPage = 0U;
  uint32_t ulPreviousPage = 0U;

