kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
			ulReadAddr = (ucReadData[0]<<24|ucReadData[1]<<16|ucReadData[2]<<8|ucReadData[3]);
 			if (ulReadAddr != 0xFFFFFFFFU)
 			{
				ulData = (ucReadData[4]<<24|ucReadData[5]<<16|ucReadData[6]<<8|ucReadData[7]);
 				usCRCCalculated = xCrc16BitPolinomial_1021(&ucReadData[4],4,0);

 				usCRCRead = (ucReadData[8]<<8|ucReadData[9]);
 				if (usCRCCalculated == usCRCRead)
 				{
					memcpy((void *)ulReadAddr,(const void *) &ulData, sizeof(ulData));
#if(EMUL_DEBUG_ENABLE == 1)
					printf("ESR_S:Data = 0x%lx\t,VAdr = 0x%lx\t,CRC= 0x%x\n",ulData,ulReadAddr,usCRCRead);
#endif
 				}
 				else
 				{
 					return EE_READ_DATA_INVALID;
 				}
 			}
			else
			{
				/*do nothing*/
			}
 			/* Next address location */
 			ulCounter += EE_ELEMENT_SIZE;
 		}
		}
 	 return EE_OK;
 }

 /**
   * @brief  Initializes the shadowRAM with default values of variables
   * 		and update with last saved values in eeprom.
   * @param  None.
   * @retval None
   */


 void vShadowRAM_Init(void)
 {
 	/* Write default values into eep_Variables_t */
 	memcpy(&eep_Variables_t, &eep_default_t, sizeof(eepromData_t));

 	xShadowUpdate();

 }

 /**
   * @brief  Write Variables in EEPROM and ShadowRAM.
   * @param  VirtAddress Variable name to be write
   * @param  Data Data to be write
   * @param  UpdateToShadowRAM update data into shadowRAM
   * @retval Status of the operation of during EEPROM write
   */

 uint16_t xES_WriteVariable(uint32_t VirtAddress, uint32_t Data,uint32_t *UpdateToShadowRAM)
 {
	if(*UpdateToShadowRAM != Data)
	{
#if(EMUL_DEBUG_ENABLE == 1)
		printf("SHRAM:%ld,Data:%ld\n",*UpdateToShadowRAM,Data);
#endif
		if (BSP_ERROR_NONE == xEE_WriteVariable32bits(VirtAddress, Data)) //Write into EEPROM
		{
			*UpdateToShadowRAM = Data;
		}
		else
		{
			return BSP_ERROR_COMPONENT_FAILURE;
		}
	}
	return BSP_ERROR_NONE;
 }
/**************************************************************************************************
 * End Of File
***************************************************************************************************/
